import java.util.Scanner;

public class Ex2_Bonus_points {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int number = Integer.parseInt(scanner.nextLine()); // числото от конзолата

        double bonus = 0; // задаваме начална стойност 0 , или 0.0 не е от особено значение тук
        // ако този 9-ти ред го закоментирам , после на всеки ред при думата bonus трябва да напиша double ,
        // както и примерно sout(bonus) след всеки if да пиша , не е много удачно така
        // и вместо така да се преизползва променливата , просто си пишем 9тия ред - тоест задаваме
        // на променливата типа - вслучая double и я преравняваме на 0 , вместо по 1000000 пъти долу в
        // кода да пиша типа и sout , както и тези последните двата реда от програмата трябва да си ги
        // преместя по if else конструкциите и тва не е добра практика


        // започваме с проверките
        if(number <= 100) {   // числото да е по-малко или равно на 100
            bonus = 5;
        } else if(number > 1000) { // числото да е по-голямо от 1000
            bonus = number * 0.1;
        } else {  // числото да е между 101 и 1000
            bonus = number * 0.2;
        }
    // ако тук имах числото да ми е > 100 или  < 100 и изобщо да нямам вариант да е между 100 и 1000 тогава
    // нямаше да имам нужда от последния else


        // допълнителни бонус точки
        if (number % 2 == 0) { // ако моят остатък е равен на 0 , то числото ми е четно
            bonus += 1; // bonus = bonus + 1 ;

        } else if (number % 10 == 5) { // else if, защото конкретно знам какво точно трябва да му направя
            // и какво условие трябва да му задам
            // ... 35 % 10 = 3 , остатъкът е 5
            bonus += 2;  // bonus = bonus + 2 ;

        }

        System.out.println(bonus);
        System.out.println(number + bonus);


    }
}
